{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and confidence.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend files and their roles in styling, config, layout, and PWA behavior.",
  "frontend/index.css": "Defines global Tailwind base styles and OKLCH theme variables for light and dark modes.",
  "frontend/index.html": "Main HTML entry with metadata and root mount point, free of PWA tags.",
  "frontend/public/manifest.webmanifest": "Empty manifest placeholder.",
  "frontend/public/offline.html": "Empty offline fallback page placeholder.",
  "frontend/public/sw.js": "Empty service worker placeholder.",
  "frontend/src/App.tsx": "Composes the main page structure with header, content sections, and footer.",
  "frontend/src/components/landing/AboutSection.tsx": "About section with mission/values cards and a CTA scrolling to the contact section.",
  "frontend/src/components/landing/ContactSection.tsx": "Contact section containing info cards and a demo contact form with smooth-scroll helpers.",
  "frontend/src/components/landing/FeaturesSection.tsx": "Displays a grid of six feature cards with icons and descriptions.",
  "frontend/src/components/landing/HeroSection.tsx": "Hero banner with messaging, CTAs for navigation, and highlight metrics.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer component with brand section, quick links, resources, and smooth-scroll handlers.",
  "frontend/src/components/layout/SiteHeader.tsx": "Sticky header with desktop and mobile navigation, smooth scrolling, and a toggleable mobile menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Simple layout wrapper that centers content within a max-width container.",
  "frontend/src/components/pwa/OfflineNotice.tsx": "Empty placeholder component for offline/PWA notices.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity authentication context and provider managing login, stored identities, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Example React Query hook demonstrating how to query with an authenticated actor.",
  "frontend/src/index.css": "Tailwind base styles with custom OKLCH color variables, dark mode tokens, and typography rules.",
  "frontend/src/main.tsx": "Application entry point setting up React Query, Internet Identity provider, and global styles.",
  "frontend/src/pwa/registerServiceWorker.ts": "Stub that disables service worker registration for non-PWA delivery.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, container settings, animations, and theme tokens.",
  "project_state.json": "Defines current project scope prioritizing a fully clickable website mock while deferring PWA features, and lists existing features and requests related to site frontend, theme, and PWA changes."
}